# removeLeader Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnnotationSymbol..::..removeLeader Method
AnnotationSymbol Class See Also
---
remove a leader of this annotation symbol.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void removeLeader()
```

Visual Basic
---
```text
Public Sub removeLeader
```

Visual C++
---
```text
public:
void removeLeader()
```

# See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace